##1. Задача
##
##    Користувач вводить символ із клавіатури.
##
##    Необхідно вивести на екран кількість разів, скільки цей символ зустрічається в кортежі як елемент.
##
##    Кортеж = (2, 0, 3, 4, 0, “G”, ”A”, ”F”, “L”, “Q”, “a”, “a”, “h”, “o”, “p”, “w”, “w”, “x”, “x”, 5, 6, 10, 11, 7, 7, 8, 0, 15, 2, 3, 4, “r”, “r”, “r”, “e”, “e”, “a”).
##
##
##        1.1. Порахуйте кількість цифр у цьому кортежі.
##        1.2. Порахуйте кількість літер у цьому кортежі.
##        1.3. Порахуйте кількість Upper букв у цьому кортежі.
##
##Cortege = (2, 0, 3, 4, 0, "G", "A", "F", "L", "Q", "a", "a", "h", "o", "p", "w", "w", "x", "x", 5, 6, 10, 11, 7, 7, 8, 0, 15, 2, 3, 4, "r", "r", "r", "e", "e", "a")
##
##
##num = list(filter(lambda i: i if str(i).isdigit() == True else False, Cortege))
##print("Кількість цифр у кортежі =", len(num), num)
##letter = list(filter(lambda i: i if str(i).isalpha() == True else False, Cortege))
##print("Кількість літер у кортежі =", len(letter), letter)
##upper_letter = list(filter(lambda i: i if str(i).upper() == str(i) else False, letter))
##print("Кількість Upper букв у кортежі =", len(upper_letter), upper_letter)
##
##2. Задача
##
##    Є кортежі з цілими числами:
##        (2, 8, 10, 25, 1, 2, 771, 125, 256, 100, 8, 10, 81, 96, 8, 1, 144, 5).
##
##    Потрібно вивести статистику кількості цифр в елементах кортежу.
##
##    Наприклад:
##
##        Кортеж = (1, 2, 3, 11, 22, 33, 44, 111, 222, 333, 444, 555)
##        Одна цифра – 3 елементи;
##        Дві цифри - 4 елементи;
##        Три цифри – 5 елементів.
##
##kortege = (2, 8, 10, 25, 1, 2, 771, 125, 256, 100, 8, 10, 81, 96, 8, 1, 144, 5)
##
##list = list(filter(lambda i: i if str(i).isdigit() == True else False, kortege))
##
##num1 = 0
##num2 = 0
##num3 = 0
##
##for i in list:
##    if len(str(i)) == 1:
##        num1 += 1
##    elif len(str(i)) == 2:
##        num2 += 1
##    elif len(str(i)) == 3:
##        num3 += 1
##print("Кількість однознвчних цифр =", num1)
##print("Кількість двознвчних цифр =", num2)
##print("Кількість трьохзнвчних цифр =", num3)
##
##3. Задача
##
##    Існує дві множини.
##
##        Перше: Комедія, Драма, Пригоди, Вестерн, Жах, Фантастика.
##        Друге: Бойовик, Мелодрама, Вестерн, Жах, Містика, Комедія.
##
##    Необхідно створити третю множину, що містить назви, які є в обох множинах.
##
##set1 = {"Комедія", "Драма", "Пригоди", "Вестерн", "Жах", "Фантастика"}
##set2 = {"Бойовик", "Мелодрама", "Вестерн", "Жах", "Містика", "Комедія"}
##se3 = set1 & set2
##print("Третя множина =", se3)
##
##4. Задача
##
##
##    Існує дві множини.
##
##        Перше: Комедія, Драма, Пригоди, Вестерн, Жах, Фантастика.
##        Друге: Бойовик, Мелодрама, Вестерн, Жах, Містика, Комедія.
##
##    Необхідно створити третю множину, що містить назви, які є в першій множині, але немає в другій.
##
##set1 = {"Комедія", "Драма", "Пригоди", "Вестерн", "Жах", "Фантастика"}
##set2 = {"Бойовик", "Мелодрама", "Вестерн", "Жах", "Містика", "Комедія"}
##se3 = set1 - set2
##print("ТНазви які є в першій множині, але немає в другій =", se3)
##
##5. Задача
##
##    Існує дві множини.
##
##        Перше: Комедія, Драма, Пригода, Вестерн, Жах, Фантастика.
##        Друге: Бойовик, Мелодрама, Вестерн, Жах, Містика, Комедія.
##
##    Необхідно створити третю множину, що містить назви, які є в другій множині, але немає в першій.
##
##set1 = {"Комедія", "Драма", "Пригоди", "Вестерн", "Жах", "Фантастика"}
##set2 = {"Бойовик", "Мелодрама", "Вестерн", "Жах", "Містика", "Комедія"}
##se3 = set2 - set1
##print("ТНазви які є в другій множині, але немає в першій =", se3)
##
##6. Задача
##
##    Існує дві множини.
##        
##        Перше: Комедія, Драма, Пригода, Вестерн, Жах, Фантастика.
##        Друге: Бойовик, Мелодрама, Вестерн, Жах, Містика, Комедія.
##
##    Необхідно створити третю множину, що містить унікальні назви для кожної множини.

##set1 = {"Комедія", "Драма", "Пригоди", "Вестерн", "Жах", "Фантастика"}
##set2 = {"Бойовик", "Мелодрама", "Вестерн", "Жах", "Містика", "Комедія"}
##se3 = set1 ^ set2
##print("Унікальні назви для кожної множини =", se3)
