##  Завдання 1.

##      Користувач із клавіатури вводить чотиризначне число. Необхідно перевернути число та
##      відобразити результат.
##      Наприклад:
##      Користувач вводить: 4512,
##      На виході отримує результат: 2154.

##a=input("Enter a four-digit number: ")
##print(a[::-1])

##  Завдання 2.

##      Користувач із клавіатури вводить тризначне число. Потрібно показати на різних рядках
##      значення першого, другого та третього числа. Також потрібно показати на окремому рядку
##      суму цих трьох чисел.
##      Наприклад: Користувач вводить: 891. На виході отримує результат:
##      1st number = 8,
##      2nd number = 9,
##      3rd number = 1.
##      Sum = 18.

##a=int(input("Enter a three-digit number: "))
##
##b=a//100
##print("Значення першого ряду =",b)
##c=a//10%10
##print("Значення другого ряду =",c)
##d=a%10
##print("Значення третього ряду =",d)
##print("Сума всіх чисел =",b+c+d)

##  Завдання 3.

##      Користувач вводить з клавіатури дві цифри з інтервалу 10 - 99. Необхідно створити число,
##      що містить ці цифри, у такому порядку, перше число множиться на 7, друге число
##      множиться на 9, а після цього вони змінюються місцями і результат виводимо на екран.
##      Наприклад:
##      Користувач вводить: 35.
##      Обробка: 3*7=21, 5*9=45, міняємо місцями отримуємо число 4521.
##      На виході отримує результат: 4521.

##a=int(input("Enter a two-digit number from 10 to 99: "))
##
##a1=a//10
##print(a1)
##num1=a1*7 # Множимо перше число на 7
##a2=a%10
##print(a2)
##num2=a2*9 # Множимо друге числоь на 9
##result=str(num2)+str(num1)
##print("Result =",result)

##Завдання 4.

##Користувач вводить з клавіатури два тексти. На виході відображається кількість символів у
##тексті, а також який текст довший.
##Наприклад:
##Користувач вводить text1: "Python";
##Користувач вводить text2: "C++";
##Результат: text1 = 6, text2 = 3, text1> text2.

##a=input("Enter text 1: ")
##b=input("Enter text 2: ")
##
##text1=len(a)
##text2=len(b)
##
##if text1>text2:
##    print(a,"=",text1,b,"=",text2,"text1 > text2")
##else:
##    print(b,"=",text2,a,"=",text1,"text2 > text1")
##    

##Завдання 5.

##Користувач вводить текст із клавіатури. На виході потрібно показати кожен третій знак у
##тексті.
##Наприклад:
##Користувач вводить text1: Python Python Python Python;
##Результат: Ph tnyoPh.

##a=input("Enter text: ")
##print(a[:len(a):3])


##Завдання 6.

##Користувач вводить слово з клавіатури. Необхідно перевірити, чи збігається перша і остання
##літера цього слова.
##Наприклад:
##Користувач вводить word: "python";
##Результат: p <> n, "Unhappy"
##Користувач уводить word: “talent”;
##Результат: t <> t, “Happy”.

##import random
##
##ver.1
##
##a=input("Enter text: ")
##b=len(a)
##b1=random.randint(0,0)
##leter_1=(a[b1])
##b2=random.randint(b-1,len(a)-1)
##leter_2=(a[b2])
##b2=random.randint(0,0)
##leter_2=(a[b2])
##
##if leter_1==leter_2:
##    print(leter_1,"<>",leter_2,"Happy")
##else:
##    print(leter_1,"<>",leter_2,"Unhappy")
##
##ver.2
##
##a=input("Enter text: ")
##print(a[0])
##print(a[-1])
##if a[0]==a[-1]:
##    print("Happy")
##else:
##    print("Unhappy")
