# 1. Завдання

# Напишіть функцію, яка на вхід отримує число від користувача, а на виході показує парне чи непарне число.

# def myfunc():
#    num = int(input("Enter num > "))
#    if num % 2 == 0:
#        print("Even >", num)
#    else:
#        print("Odd >", num)
#
# # ------------------main----------------
#
# myfunc()

# 2. Завдання

# Напишіть функцію, яка на вхід отримує текст від користувача, а на виході показує кількість символів у цьому тексті.

# def text_len():
#    text = input("Enter text > ")
#    print(text, ">>>", len(text))
# # ------------------main----------------
# text_len()


# 3. Завдання

# Використовуючи функції, напишіть програму

##    - яка на вхід отримує число в інтервалі від -9999 до 9999,
##    - а потім в залежності від вибору користувача показує
##    - дзеркальне число,
##    - суму чисел цього числа,
##    - кількість цифр у цьому числі,
##    - показує квадрат цього числа.
##    
##    Наприклад:
##        
##    - Користувач вводить: 100;
##    - а. Дзеркальне число: 001;
##    - б. Сума чисел: 1+0+0=1;
##    - в. Кількість цифр: 3;
##    - г. Квадрат цього числа: 1002 = 10 000.


# def my_func():
#    print("Введіть число: ")
#    num = int(input())
#    if num < -9999 or num > 9999:
#        print("Введіть число від -9999 до 9999")
#    elif num > -9999 and num < 9999:
#        value = input("""
#    1. Дзеркальне число
#    2. Сума чисел
#    3. Кількість цифр
#    4. Квадрат цього числа
# """)
#        if value == '1':
#            if num > 0:
#                num = str(num)
#                print(f"Дзеркальне число: {num[::-1]}")
#            elif num < 0:
#                num = str(num)
#                print(f"Дзеркальне число: -{num[-1:-5:-1]}")
#        elif value == '2':
#            if num > 0:
#                num = str(num)
#                sum_num = int(num[0]) + int(num[1]) + int(num[2]) + int(num[3])
#                print("Сума чисел:", sum_num)
#            elif num < 0:
#                num = str(num)
#                sum_num = int(num[1]) + int(num[2]) + int(num[3]) + int(num[4])
#                print("Сума чисел:", sum_num)
#        elif value == '3':
#            if num > 0:
#                print(f"Кількість цифр: {len(str(num))}")
#            elif num < 0:
#                print(f"Кількість цифр: {len(str(num)) - 1}")
#        elif value == '4':
#            print(f"Квадрат цього числа: {num**2}")
# #----------------------main----------------------------------
#
# my_func()
       
                       
# 4. Використовуючи функції, напишіть програму, яка в залежності від вибору користувача дозволяє розрахувати:

##    - об'єм куба
##    - об'єм циліндра
##    - об'єм сфери
##    - об'єм піраміди
##    - об'єм конуса

# import math
#
# def volume():
#    print("""
#    1. Об'єм куба
#    2. Об'єм циліндра
#    3. Об'єм сфери
#    4. Об'єм піраміди
#    5. Об'єм конуса
#    """)
#    choice = int(input("Виберіть один з пунктів: "))
#    if choice == 1:
#       print("Введіть розмір сторони куба: ")
#       a = int(input())
#       v = a**3
#       print(f"Об'єм куба: {v}")
#    elif choice == 2:
#       h = int(input("Введіть висоту циліндра: "))
#       r = int(input("Введіть радіус циліндра: "))
#       v = math.pi*(r**2)*h
#       print(f"Об'єм циліндра: {round(v,2)}")
#    elif choice == 3:
#       r = int(input("Введіть радіус сфери: "))
#       v = 4/3*math.pi*(r**3)
#       print(f"Об'єм сфери: {round(v,2)}")
#    elif choice == 4:
#       h = int(input("Введіть висоту піраміди: "))
#       s = int(input("Введіть основу піраміди: "))
#       v = (1/3*s*h)
#       print(f"Об'єм піраміди: {round(v,2)}")
#    elif choice == 5:
#       h = int(input("Введіть висоту конуса: "))
#       r = int(input("Введіть радіус конуса: "))
#       v = 1/3*math.pi*(r**2)*h
#       print(f"Об'єм конуса: {round(v,2)}")
#
# volume()
