##1. Завдання
##
##    Використовуючи цикл for виведіть усі числа від 100 до 999, які поділяються на 3 та 7.

##for i in range(100,1000):
##        if i%3==0 and i%7==0:
##            print(i)

##2. Завдання
##
##    Використовуючи цикл for виведіть усі числа від 100 до 999, які поділяються на 4 та 9.

##for i in range(100,1000):
##        if i%4==0 and i%9==0:
##            print(i)

##3. Завдання
##
##    Використовуючи цикл for виведіть усі числа від 100 до 999, які містять хоча б дві однакові
##    цифри.
##
##        Наприклад:
##
##    101, 111, 112, 113, 114, 115, 116, 117, 118, 119, 121, 122, 131, 133 і т.д.

##for i in range(100,1000):
##    i=str(i)
##    if i[0]==i[1] or i[0]==i[2] or i[1]==i[2]:
##        print(i)

##4. Завдання
##
##    Використовуючи for на виході необхідно зіставити результат зведення в ступінь, перше
##    число - основа (за зростанням), друге число - ступінь (за спаданням), числа задані в
##    інтервалі від 1 до 9.
##
##        Результат:
##
##    19 = 1
##    28 = 256
##    37 = 2187
##    46 = 4096 …..

##for a in range(1,10):
##    if a==1:
##        print(a**9)
##    elif a==2:
##        print(a**8)
##    elif a==3:
##        print(a**7)
##    elif a==4:
##        print(a**6)
##    elif a==5:
##        print(a**5)
##    elif a==6:
##        print(a**4)
##    elif a==7:
##        print(a**3)
##    elif a==8:
##        print(a**2)
##    elif a==9:
##        print(a**1)
##    else:
##        continue

# ver.2

j = 9
for i in range(1,10):
    print("i",i,"j",j)
    print(i,"^",j,i**j)
    j=j-1

##5. Завдання
##
##    Використовуючи while вивести всі парні числа в інтервалі від 1 до 50. Виведення даних
##    зробити горизонтальним і через кому.
##
##        Приклад: 2, 4, 6, …., 46, 48, 50

##a=0
##
##while a<=50:
##    print(a,end=", ")
##    a=a+2


##6. Завдання
##
##    Використовуючи while вивести всі непарні числа в інтервалі від 1 до 50. Виведення даних
##    зробити горизонтальним і через кому.
##
##    Приклад: 1, 3, 5, …., 45, 47, 49

##a=1
##
##while a<=50:
##    print(a,end=", ")
##    a=a+2

##7. Завдання
##
##    Формула для розрахунку зміни відстані тіла з часом має вигляд 20t2 + 17t + 5,
##    використовуючи for в інтервалі часу від 1 до 20 з кроком у 2 одиниці, зробіть вертикальне
##    виведення даних у вигляді час і відстань.
##
##        Результат:
##
##    t=1 sec, s=42 m
##    t=3 sec, s=236 m
##    t=5 sec, s=590 m

##for t in range(1,21,2):
##    print(f"t={t} sec, s={(20*(t**2))+(17*t)+5} m")
