# Напишіть програму, яка з отриманого текстового файлу виконує такі дії:

    # a) В окремому файлі відображається загальна кількість слів;
    # b) В окремому файлі відображає всі слова, які мають довжину більше 5;
    # c) В окремому файлі відображає всі цифри, які є у тексті;
    # d) В окремому файлі відображає текст у зворотному порядку;
    # e) В окремому файлі змінює пропуск на знак @

# Таким чином, на вході один файл, а на виході п'ять різних файлів.

    # Зміст тексту для основного файлу:

# Згідно з вибірковим опитуванням 7502 підприємств у всьому світі,
# проведеному 30 березня — 12 квітня 2022 року компанією Morning Consult на замовлення IBM, світова частка підприємств, які впровадили штучний інтелект, наразі становить 35%, збільшившись на 4 відсоткові пункти з 2021 року. У Китаї та Індії найвищі показники розгортання штучного інтелекту – 58% та 57% відповідно, тоді як у Канаді – 28%, у Великій Британії – 26%, у США – 25% та у Південній Кореї – 22%.
# Хоча все більше підприємств вважають надійність штучного інтелекту важливою, більшість із них не вжили заходів, щоб переконатися, що їхній штучний інтелект є надійним та відповідальним:
# 74% не зменшили ненавмисне упередження;
# 68% не відстежувало зміни продуктивності та зміни моделі;
# 61% не переконалися, що вони можуть пояснити рішення за допомогою ШІ;
# 60% не розробили моральну політику ШІ.
# Серед факторів, що перешкоджають успішному впровадженню ШІ, є такі:
# 34 % опитаних підприємств вважають перешкодою обмежені навички, досвід чи знання ШІ; надто висока ціна (29%); відсутність інструментів чи платформ для розробки моделей (25%); проекти надто складні чи важкі для інтеграції чи масштабування (24%); та велика складність даних (24%). З опитаних підприємств дві третини впроваджують або планують використовувати ШІ для досягнення цілей сталого розвитку.

with open("/Users/andriisumnevych/Documents/Home05092024.txt","r") as file_text:
    file_read = file_text.read()
    list_text = file_read.split()
    ln = len(list_text)
    print(f"a) Кількість символів у тексті: {ln}")
    with open("/Users/andriisumnevych/Documents/Home_len.txt","w") as file_len:
        file_len.write(str(ln))
    len_5 = [list_text[i] for i in range(len(list_text)) if len(list_text[i]) >= 5]
    print("b) Слова, що мають довжину більше 5 символів >", len_5)
    with open("/Users/andriisumnevych/Documents/Home_5.txt","w") as file_5:
        file_5.write(str(len_5))
    num = []
    for i in range(len(file_read)):
        if file_read[i].isdigit():
            num.append(file_read[i])
    print("c) Цифри >", num)
    with open("/Users/andriisumnevych/Documents/Home_num.txt","w") as file_num:
        file_num.write(str(num))ß
    rev = file_read[::-1]
    print("d) Зворотний текст >", rev)
    with open("/Users/andriisumnevych/Documents/Home_rev.txt","w") as file_rev:
        file_rev.write(str(rev))
    repl = file_read.replace(" ","@")
    print("e) Текст з заміненими пробілами на @ >", repl)
    with open("/Users/andriisumnevych/Documents/Home_repl.txt","w") as file_repl:
        file_repl.write(str(repl))
