# 1. Завдання

#    Напишіть програму, яка на вхід отримує значення двох чисел a та b, а на виході
#    показує різницю їх перетворень. При цьому число a і b перетворюються за
#    різними алгоритмами:

#        для а: ((𝑎4) ∗ 𝜋 + 100)/𝑎2;
#        для b: (((𝑏3) + 100) ∗ 𝜋)/𝑏2.

#   Наприклад: a= 1 и b=2:

#        для а: ((𝑎4) ∗ 𝜋 + 100)/𝑎2= ((1**4) ∗ 3,14 + 100)/(1)2=103,14
#        для b: ((𝑏3 + 100) ∗ 𝜋)/zip=(((2**3) + 100) ∗ 𝜋)/(2)2=87,78

#        Результат: a – b = 15,36

# import math
# def difference():
#     a = int(input("Enter number a: "))
#     b = int(input("Enter number b: "))
#     print(f"Result: a - b = {round(((a**4)*math.pi+100)/(a**2) - ((b**3+100)*math.pi)/(b**2),2)}")
#
# #------------------main--------------------------------
#
# difference()
#
# a1 = ((1**4)*3.14+100)/(1**2)
# b1 = (((2**3)+100)*3.14)/2**2
#
# print(f"Result: a({a1}) - b({b1}) = {a1 - b1}")

# 2. Завдання

    # Напишіть програму, яка на вхід отримує слово розміром до 5 літер, а на виході
    # складає суму з чисел відповідних символів та перевірять отриману суму на
    # парність чи непарність. Для перекладу літери/символу до числа
    # використовуйте ord(). Використовуйте функції під час написання програми.

    # Наприклад:
    
#        text = car;
#        c = 99; a = 97; r = 114.
#        sum = 310.
#        Слово car - парне.

# def text_5():
#     while True:
#         text = input("Введіть слово до 5 літер: ")
#         if len(text) > 5:
#             print("Слово занадто довге")
#         elif len(text) <=5:
#             sum = 0
#             numbers = []
#             for i in text:
#                 sum += ord(i)
#                 numbers.append(ord(i))
#             print(f"Sum: {numbers} = {sum}")
#             if sum % 2 == 0:
#                 print("Слово", text, "- парне.")
#             else:
#                 print("Слово", text, "- непарне.")
#             break
#         else:
#             print("Ви ввели некоректне значення")
#             break
#
# #---------------------main--------------------
#
# text_5()

# 3. Завдання

#    Даний список ["Category",5,10,"Movie","Game",20,18,"App","Source",50]

#        a). Порахуйте суму чисел із цього списку.
#        b). Зробіть список лише з тексту та відсортуйте його.
#        c). Поміняйте місцями 7-й та 2-й елемент списку.
#        d). Видаліть всі парні елементи зі списку.

list = ["Category",5,10,"Movie","Game",20,18,"App","Source",50]

print(list)
list_number = [i for i in list if type(i) == int]
list_text = sorted([i for i in list if type(i) == str])


print(list_number)
print(list_text)

# 4. Завдання

#     Напишіть функцію, яка у випадковому порядку визначаємо місяць,
#     а також функцію, яка у випадковому порядку визначаємо день.
#     На виході користувача є функція, яка показує, який це знак Зодіаку.

# 5. Завдання

#    Напишіть функцію, яка у випадковому порядку визначаємо місяць,
#    а також функцію, яка у випадковому порядку визначаємо день.
#    На виході користувача є функція, яка показує, який це сезон (Зима, Літо, Осінь, Весна).
