# 1. Завдання
#
# Показати на екрані таблицю множення всіх чисел від 1 до 9.
# У такому вигляді:

# 1 2  3  4  5  6  7  8  9
# 2 4  6  8  10 12 14 16 18
# 3 6  9  12 15 18 21 24 27
# 4 8  12 16 20 24 28 32 36
# 5 10 15 20 25 30 35 40 45
# 6 12 18 24 30 36 42 48 54
# 7 14 21 28 35 42 49 56 63
# 8 16 24 32 40 48 56 64 72
# 9 18 27 36 45 54 63 72 81

# ver.1

##a = 9
##b = 9
##i = 0
##
##for i in range(a):
##    i=i+1
##    for j in range(b):
##        j=j+1
##        if i==j:
##            c=print(i*i," ",end="")
##        else:
##            d=print(i*j," ",end="")
##    print("\n")
##print("\n", end="")

# ver.2

##a = 9
##i = 0
##
##while i<a:
##    i=i+1
##    print(i*1,i*2,i*3,i*4,i*5,i*6,i*7,i*8,i*9)

# ver.2

##while i<a:
##i = i + 1
##for j in range(1,10):
##print(i*j, sep="")

# Не можу зрозуміти як у циклі перемножити змінну "і" на 9 по черзі, щоб не робити так багато змінних!

# 2. Завдання
#
# Використовуючи цикл for намалюйте наступну фігуру, якщо користувач задає розмір
# сторони та символ:

# Наприклад:

# Сторона квадрата = 5
# Символ = #
# 1 #####
# 2
# 3 #####
# 4
# 5 #####

# ver.1

##a = int(input("Сторона квадрата = "))
##b = input("Символ = ")
##
##for i in range(a):
##    i=i+1
##    print(i,"",end="")
##    if i%2!=0:
##        print(b*a)
##    else:
##        print(" "*a)

# ver.2

##a=int(input("Сторона квадрата = "))
##b = input("Символ = ")
##i=0
##
##while i<a:
##    i=i+1
##    if i%2!=0:
##        print(i,b*a)
##    else:
##        print(i," "*a)


# 3. Завдання

# Використовуючи цикл for намалюйте наступну фігуру, якщо користувач задає розмір
# сторони та символ для парного та непарного рахунку:
# Наприклад:
# Сторона квадрата = 5
# Символ = #, *
# 1 #####
# 2 *****
# 3 #####
# 4 *****
# 5 #####

# ver.1

# a = int(input("Сторона квадрата = "))
# b = input("Символ для непарного числа = ")
# с = input("Символ для парного числа = ")
#
# for i in range(a):
#     i=i+1
#     print(i,"",end="")
#     if i%2!=0:
#         print(b*a)
#     else:
#         print(с*a)

# ver.2

##a=int(input("Сторона квадрата = "))
##b=input("Символ для непарного числа = ")
##c=input("Символ для парного числа = ")
##
##i=0
##
##while i<a:
##    i=i+1
##    if i%2!=0:
##        print(i,b*a)
##    elif i%2==0:
##        print(i,c*a)


# 4. Завдання

# Використовуючи цикл for намалюйте наступну фігуру, якщо користувач задає розмір
# сторони та символ:

# Наприклад:

# Сторона квадрата = 5
# Символ = #

# 1     #
# 2    #
# 3   #
# 4  #
# 5 #

# ver.1

##a=int(input("Сторона квадрата = "))
##b=input("Символ = ")
##
##for i in range(a):
##    i+=1
##    print(i," "*(a-i)+b)

# ver.2

##a=int(input("Сторона квадрата = "))
##b=input("Символ = ")
##
##i=0
##
##while i<a:
##    i+=1
##    print(i," "*(a-i)+b)


# 5. Завдання

# Даний текст: “Hello Python! Hello User! How are you Python? I'm good, and you? Thank you, I'm
# good, too. Can you help me with task? Yes, sure. It's my task (show the code). I want to ask
# ChatGPT.”
# а) Порахуйте скільки речень у даному тексті;
# b) Порахуйте скільки прогалин у цьому тексті;
# c) Порахуйте скільки разів трапляється літера “a”;
# d) Переведіть цей текст у нижній регістр;
# e) Виведіть кожен 5-й символ цього тексту;
# h) Порахуйте довжину тексту і якщо вона парна вкажіть це, якщо непарна вкажіть це;
# i) Виведіть цей текст у зворотному порядку.

##text = "Hello Python! Hello User! How are you Python? I'm good, and you? Thank you, I'm good, too. Can you help me with task? Yes, sure. It's my task (show the code). I want to ask ChatGPT."
##
##a = 0
##b = 0
##c = 0
##d = 0
##e = 0
##h = False
##i = 1
##
##for i in range(len(text)):
##    if text[i] == "!" or text[i] == "?" or text[i] == ".":
##        a += 1
##    elif (text[i].isspace()):
##        b = b + 1
##    elif text[i]  == "a":
##        c = c + 1
##    elif len(text) % 2 == 0:
##        h = True
##
##print("a) Кількість речень =",a)
##print("b) Кількість прогалин =",b)
##print("c) Кількість повторювань літери \"а\" =",c)
##print("d) Текст у нижньому регістрі =", text.lower())
##print("e) Кожен 5-й символ =",text[::5])
##print("h) Кількість цифр парна? =",h,">",i+1)
##print("i) Текст у зворотньому порядку =",text[::-1])

# 6. Завдання

# Даний текст: “Our phone number + 38 (088) 125 67 92 and we are open from 9:00 to 18:00.”
# а) Порахуйте суму всіх чисел, що входять до цього тексту;
# b) Порахуйте суму всіх парних чисел, що входять до цього тексту;
# с) Порахуйте суму всіх непарних чисел, що входять до даних тексту;
# d) Порахуйте суму всіх чисел, що входять до цього тексту, які діляться на 3 без залишку.

##text = "Our phone number + 38 (088) 125 67 92 and we are open from 9:00 to 18:00."
##
##a = 0
##b = 0
##c = 0
##d = 0
##i = 0
##
##
##for i in range(len(text)):
##    if (text[i].isdigit()):
##        a = a + int(text[i])
##        if int(text[i]) % 2 == 0:
##            b = b + int(text[i])
##        elif int(text[i]) % 2 != 0:
##            c = c + int(text[i])
##        elif int(text[i]) % 3 == 0:
##            d = d + int(text[i])
##            print(d)
##
##print()
##print("a) Сума всіх чисел =",a)
##print("b) Сума всіх парних чисел =",b)
##print("c) Сума всіх непарних чисел =",c)
##print("d) Сума всіх чисел, що входять до цього тексту, які діляться на 3 =",d)

# Із d) в мене дві проблеми:
#    1. У циклі for не виходить вивести суму чисел які діляться на 3,
#       так як цифри відбираються у перших дввох ітераціях!
#    2. Якщо ставлю ітерацію "d)" на перше місце у циклі, вона відбирає числа із інших ітерацій

# Потрібно розділити на різні for!!!!